tutorials/compressible/realFluidPisoFoam/ras/t-junction/0.org/T
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | foam-extend: Open Source CFD
   \\    /   O peration     | Version:     5.0
    \\  /    A nd           | Web:         http://www.foam-extend.org
     \\/     M anipulation  | For copyright notice see file Copyright
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField uniform 333.15;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }

    inlet1
    {
        type            fixedValue;
        value           uniform 273.15;
    }

    inlet2
    {
        type            fixedValue;
        value           uniform 333.15;
    }

    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
