tutorials/compressible/realFluidPisoFoam/ras/t-junction/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//           inlet1
//             +-+
//             | |
//             | |
//             | |
//             | |
// +-----------+ |
// |outlet        |
// +-----------+ |
//             | |
//             | |
//             | |
//             | |
//             +-+
//           inlet2

convertToMeters 1;

vertices
(
    (0.0  -0.01 0)   //0
    (0.2  -0.01 0)   //1
    (0.2   0.01 0)   //2
    (0.0   0.01 0)   //3

    (0.22 -0.01 0)   //4
    (0.22  0.01 0)   //5

    (0.2  -0.21 0)   //6
    (0.22 -0.21 0)   //7

    (0.2   0.21 0)   //8
    (0.22  0.21 0)   //9

    // Z
    (0.0  -0.01 0.02)   //10
    (0.2  -0.01 0.02)
    (0.2   0.01 0.02)   //12
    (0.0   0.01 0.02)

    (0.22 -0.01 0.02)  //14
    (0.22  0.01 0.02)

    (0.2  -0.21 0.02)  //16
    (0.22 -0.21 0.02)

    (0.2   0.21 0.02)  //18
    (0.22  0.21 0.02)

);

blocks
(
    // inlet block
    hex (0 1 2 3  10 11 12 13) (50 5 5) simpleGrading (1 1 1)

    // central block
    hex (1 4 5 2  11 14 15 12) (5 5 5) simpleGrading (1 1 1)

    // bottom block
    hex (6 7 4 1  16 17 14 11) (5 50 5) simpleGrading (1 1 1)

    // top block
    hex (2 5 9 8  12 15 19 18) (5 50 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (0 10 13 3)
        );
    }

    inlet1
    {
        type patch;
        faces
        (
            (6 7 17 16)
        );
    }

    inlet2
    {
        type patch;
        faces
        (
            (8 18 19 9)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (10 11 12 13)
            (8 2 5 9)
            (18 12 15 19)
            (1 4 5 2)
            (11 14 15 12)
            (1 6 7 4)
            (11 16 17 14)
            (6 16 11 1)
            (2 12 18 8)
            (3 2 12 13)
            (0 1 11 10)
            (7 17 14 4)
            (4 14 15 5)
            (5 15 19 9)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
